n5/src/Documents/CalculationRatesDifferences/CalculationRatesDifferences.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CalculationRatesDifferences</name>
  <registerRecords>AccumulationRegister.Expenses</registerRecords>
  <registerRecords>AccumulationRegister.Debts</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.VendorDebts</registerRecords>
  <attributes>
    <name>AccountNegative</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountPositive</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Accounts</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/InformationRegisters/ExchangeRates/ExchangeRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExchangeRates</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </resources>
  <resources>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </resources>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/AccountingRegisters/General/General.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>General</name>
  <chartOfAccounts>ChartOfAccounts.General</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
  </dimensions>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Quantitative</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Quantitative</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Accrual</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>CurrencyAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>EnumRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Dependency</name>
    <type>
      <types>DocumentRef.Payment</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.Production</types>
      <types>DocumentRef.Debts</types>
      <types>DocumentRef.AdjustDebts</types>
      <types>DocumentRef.AdjustVendorDebts</types>
      <types>DocumentRef.VendorPayment</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

n5/src/AccumulationRegisters/Debts/Debts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Debts</name>
  <resources>
    <name>Accounting</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Advance</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Overpayment</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Payment</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentKey</name>
    <type>
      <types>CatalogRef.PaymentKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.Payment</types>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.AdjustDebts</types>
      <types>DocumentRef.Refund</types>
      <types>DocumentRef.Return</types>
      <types>DocumentRef.Debts</types>
      <types>DocumentRef.AdjustVendorDebts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Detail</name>
    <type>
      <types>DocumentRef.Payment</types>
      <types>DocumentRef.Invoice</types>
      <types>DocumentRef.AdjustDebts</types>
      <types>DocumentRef.Refund</types>
      <types>DocumentRef.Return</types>
      <types>DocumentRef.Debts</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

n5/src/AccumulationRegisters/VendorDebts/VendorDebts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>VendorDebts</name>
  <resources>
    <name>Accounting</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Advance</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Overpayment</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Payment</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentKey</name>
    <type>
      <types>CatalogRef.PaymentKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.AdjustVendorDebts</types>
      <types>DocumentRef.VendorRefund</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.VendorReturn</types>
      <types>DocumentRef.AdjustDebts</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.VendorPayment</types>
      <types>DocumentRef.PurchaseOrder</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.VendorDebts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Detail</name>
    <type>
      <types>DocumentRef.VendorRefund</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.VendorReturn</types>
      <types>DocumentRef.AdjustDebts</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.VendorPayment</types>
      <types>DocumentRef.CustomsDeclaration</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

n5/src/Enums/Operations/Operations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Operations</name>
  <enumValues>
    <name>AdditionalExpenses</name>
  </enumValues>
  <enumValues>
    <name>AdjustAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustDebts</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorDebts</name>
  </enumValues>
  <enumValues>
    <name>AdvanceApplied</name>
  </enumValues>
  <enumValues>
    <name>AdvanceGiven</name>
  </enumValues>
  <enumValues>
    <name>AdvanceGivenAfterAdjustments</name>
  </enumValues>
  <enumValues>
    <name>AdvanceGivenApplied</name>
  </enumValues>
  <enumValues>
    <name>AdvanceTaken</name>
  </enumValues>
  <enumValues>
    <name>AdvanceTakenAfterAdjustments</name>
  </enumValues>
  <enumValues>
    <name>Assembling</name>
  </enumValues>
  <enumValues>
    <name>AutoWritingOffForm</name>
  </enumValues>
  <enumValues>
    <name>BankExpense</name>
  </enumValues>
  <enumValues>
    <name>BankReceipt</name>
  </enumValues>
  <enumValues>
    <name>CashExpense</name>
  </enumValues>
  <enumValues>
    <name>CashReceipt</name>
  </enumValues>
  <enumValues>
    <name>CustomerPayment</name>
  </enumValues>
  <enumValues>
    <name>CustomerRefund</name>
  </enumValues>
  <enumValues>
    <name>Disassembling</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReceipt</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsDepreciation</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>IncomeTaxWithheld</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsAmortization</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>ItemsCost</name>
  </enumValues>
  <enumValues>
    <name>ItemsReceipt</name>
  </enumValues>
  <enumValues>
    <name>ItemsRetirement</name>
  </enumValues>
  <enumValues>
    <name>ItemsReturn</name>
  </enumValues>
  <enumValues>
    <name>LVIExploitation</name>
  </enumValues>
  <enumValues>
    <name>LVITransfer</name>
  </enumValues>
  <enumValues>
    <name>LVIWriteOff</name>
  </enumValues>
  <enumValues>
    <name>NegativeCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>OffsetVATImport</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherReceipt</name>
  </enumValues>
  <enumValues>
    <name>PaymentReturn</name>
  </enumValues>
  <enumValues>
    <name>PositiveCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>ProductionOutput</name>
  </enumValues>
  <enumValues>
    <name>Sales</name>
  </enumValues>
  <enumValues>
    <name>SalesDiscount</name>
  </enumValues>
  <enumValues>
    <name>SalesTax</name>
  </enumValues>
  <enumValues>
    <name>Shipping</name>
  </enumValues>
  <enumValues>
    <name>Transfer</name>
  </enumValues>
  <enumValues>
    <name>VATAdvances</name>
  </enumValues>
  <enumValues>
    <name>VATAdvancesReverse</name>
  </enumValues>
  <enumValues>
    <name>VATDiscount</name>
  </enumValues>
  <enumValues>
    <name>VATPayable</name>
  </enumValues>
  <enumValues>
    <name>VATReceivable</name>
  </enumValues>
  <enumValues>
    <name>VendorPayment</name>
  </enumValues>
  <enumValues>
    <name>VendorRefund</name>
  </enumValues>
  <enumValues>
    <name>WriteoffCharges</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/CalculationRatesDifferences/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	DocumentPresentation.StandardFields ( Fields, StandardProcessing );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	DocumentPresentation.StandardPresentation ( Metadata.Documents.CalculationRatesDifferences.Synonym, Data, Presentation, StandardProcessing );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	adjustDebts ( Env );
	commitRecords ( Env );
	makeExpenses ( Env );
	flagRegisters ( Env );
	return true;
	
EndFunction
 
Procedure getData ( Env )
	
	sqlFields ( Env );
	getFields ( Env );
	sqlRecords ( Env );
	getRecords ( Env );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Documents.Date as Date, Documents.Company as Company, Documents.AccountNegative as AccountNegative, Documents.Dim1 as Dim1,
	|	Documents.AccountPositive as AccountPositive, Documents.CashFlow as CashFlow, Documents.Dim2 as Dim2, Documents.Dim3 as Dim3
	|from Document.CalculationRatesDifferences as Documents
	|where Documents.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure getFields ( Env ) 

	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );

EndProcedure

Procedure sqlRecords ( Env )
	
	s = "
	|select case Rates.Rate when 0 then 1 else Rates.Rate end as Rate,
	|	case Rates.Factor when 0 then 1 else Rates.Factor end as Factor,
	|	Rates.Currency as Currency
	|into Rates
	|from InformationRegister.ExchangeRates.SliceLast ( &Date ) as Rates
	|;
	|select Records.Account as Account, Records.Dim1 as Dim1, Records.Dim2 as Dim2, Records.Currency as Currency, 
	|	Records.Difference < 0 as Expense,
	|	case when Records.Difference < 0 then - Records.Difference else Records.Difference end as Difference
	|into Records
	|from ( 
	|	select Records.Account as Account, Records.ExtDimension1 as Dim1, Records.ExtDimension2 as Dim2,
	|		Records.Currency as Currency,
	|		cast ( CurrencyAmountBalance / isnull ( Rates.Factor, 1 ) * isnull ( Rates.Rate, 1 ) - AmountBalance
	|			as Number ( 15, 2 ) ) as Difference 
	|	from AccountingRegister.General.Balance ( &Date, Account.Currency, , Company = &Company ) as Records
	|		//
	|		// Rates
	|		//
	|		left join Rates as Rates
	|		on Rates.Currency = Records.Currency 
	|	) as Records
	|where Records.Difference <> 0
	|and Records.Account not in (
	|	select distinct Account from Document.CalculationRatesDifferences.Accounts where Ref = &Ref
	|)
	|;
	|// #Records
	|select Records.Account as Account, Records.Dim1 as Dim1,
	|	case when Records.Dim2 refs Catalog.CashFlows then &CashFlow else Records.Dim2 end as Dim2,
	|	Records.Currency as Currency, Records.Expense as Expense, Records.Difference as Difference
	|from Records as Records
	|;
	|// #Debts
	|select Debts.Customer as Customer, Debts.Contract as Contract, Debts.Document as Document,
	|	Debts.Detail as Detail, Debts.PaymentKey as PaymentKey,
	|	Debts.AmountDifference as Accounting, Debts.AdvanceDifference as Advance
	|from (
	|	select true as Customer, Debts.Contract as Contract, Debts.Document as Document,
	|		Debts.Detail as Detail, Debts.PaymentKey as PaymentKey,
	|		cast ( AmountBalance / isnull ( Rates.Factor, 1 ) * isnull ( Rates.Rate, 1 ) - AccountingBalance
	|			as Number ( 15, 2 ) ) as AmountDifference,
	|		cast ( OverpaymentBalance / isnull ( Rates.Factor, 1 ) * isnull ( Rates.Rate, 1 ) - AdvanceBalance
	|			as Number ( 15, 2 ) ) as AdvanceDifference
	|	from AccumulationRegister.Debts.Balance ( &Date, Contract.Owner in ( select Dim1 from Records ) ) as Debts
	|		//
	|		// Rates
	|		//
	|		left join Rates as Rates
	|		on Rates.Currency = Debts.Contract.Currency 
	|	union all
	|	select false, Debts.Contract, Debts.Document, Debts.Detail, Debts.PaymentKey,
	|		cast ( AmountBalance / isnull ( Rates.Factor, 1 ) * isnull ( Rates.Rate, 1 ) - AccountingBalance
	|			as Number ( 15, 2 ) ),
	|		cast ( OverpaymentBalance / isnull ( Rates.Factor, 1 ) * isnull ( Rates.Rate, 1 ) - AdvanceBalance
	|			as Number ( 15, 2 ) )
	|	from AccumulationRegister.VendorDebts.Balance ( &Date, Contract.Owner in ( select Dim1 from Records ) ) as Debts
	|		//
	|		// Rates
	|		//
	|		left join Rates as Rates
	|		on Rates.Currency = Debts.Contract.Currency
	|	) as Debts
	|where Debts.AmountDifference <> 0
	|or Debts.AdvanceDifference <> 0
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure getRecords ( Env ) 

	q = Env.Q;
	fields = Env.Fields;
	q.SetParameter ( "Date", fields.Date );
	q.SetParameter ( "Company", fields.Company );
	q.SetParameter ( "CashFlow", fields.CashFlow );
	SQL.Perform ( Env );

EndProcedure

Procedure adjustDebts ( Env )
	
	date = Env.Fields.Date;
	registers = Env.Registers;
	debts = registers.Debts;
	vendorDebts = registers.VendorDebts;
	for each row in Env.Debts do
		r = ? ( row.Customer, debts.Add (), vendorDebts.Add () );
		FillPropertyValues ( r, row );
		r.Period = date;
	enddo;

EndProcedure 

Procedure commitRecords ( Env )
	
	p = GeneralRecords.GetParams ();
	fields = Env.Fields;
	p.Date = fields.Date;
	p.Company = fields.Company;
	p.Recordset = Env.Registers.General;
	accountNegative = fields.AccountNegative;
	accountPositive = fields.AccountPositive;
	dim1 = fields.Dim1;
	dim2 = fields.Dim2;
	dim3 = fields.Dim3;
	operations = Enums.Operations;
	positiveDifference = operations.PositiveCurrencyDifference;
	negativeDifference = operations.NegativeCurrencyDifference;
	for each row in Env.Records do
		if ( row.Expense ) then
			account = "Cr";
			p.AccountDr = accountNegative;
			p.DimDr1 = dim1;
			p.DimDr2 = dim2;
			p.DimDr3 = dim3;
			p.Content = negativeDifference;
		else
			account = "Dr";
			p.AccountCr = accountPositive;
			p.Content = positiveDifference;
		endif;
		p.Amount = row.Difference;
		p [ "Account" + account ] = row.Account;
		p [ "Dim" + account + "1" ] = row.Dim1;
		p [ "Dim" + account + "2" ] = row.Dim2;
		p [ "Currency" + account ] = row.Currency;
		GeneralRecords.Add ( p );
	enddo; 

EndProcedure 

Procedure makeExpenses ( Env )
	
	amount = Env.Records.Copy ( new Structure ( "Expense", true ) ).Total ( "Difference" );
	if ( amount = 0 ) then
		return;
	endif;
	fields = Env.Fields;
	movement = Env.Registers.Expenses.Add ();
	movement.Period = fields.Date;
	movement.Document = Env.Ref;
	movement.Account = fields.AccountNegative;
	value = fields.Dim1;
	if ( TypeOf ( value ) = Type ( "CatalogRef.Expenses" ) ) then
		movement.Expense = value
	endif;
	value = fields.Dim2;
	if ( TypeOf ( value ) = Type ( "CatalogRef.Departments" ) ) then
		movement.Department = value
	endif;
	movement.AmountDr = amount;
	
EndProcedure

Procedure flagRegisters ( Env )
	
	registers = Env.Registers;
	registers.General.Write = true;
	registers.Expenses.Write = true;
	registers.Debts.Write = true;
	registers.VendorDebts.Write = true;
	
EndProcedure

#endregion

#endif
